In [19]:
import pandas as pd
import numpy as np

In [20]:
df = pd.read_csv("FoodBalanceSheets_E_Africa_NOFLAG (0).csv",encoding = "latin-1")
df.head()

,ï»¿Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [21]:
#total number of unique countries in the dataset

df["Area"].nunique()

49

In [22]:
array  = ([[94, 89, 63],

             [93,92, 48],

             [92, 94, 56]])


#To select  the elements in bold and italics from the array


array[:1] [1:]

array[:1,  1:]

TypeError: list indices must be integers or slices, not tuple

In [23]:
lis =["Y2014","Y2015","Y2016","Y2017","Y2018"]

high = df.groupby(["Element"])[lis].sum()
high.max()

Y2014    1996716.35
Y2015    2021493.55
Y2016    2044842.70
Y2017    2088198.10
Y2018    2161192.10
dtype: float64

In [24]:
ms = df["Y2014"].isna().sum()
ms

1589

In [25]:
pms = round((ms/len(df["Y2014"])* 100),3)
pms

2.607

In [26]:
y = [(2, 4), (7, 8), (1, 5, 9)]

x = y[1][-1]
x

8

In [27]:
x = y[1][1]
x

8

In [28]:
S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

In [29]:
d = df.groupby(["Area"])["Y2017"].sum()

d.max()
d.sort_values( ascending = False).head()

Area
Nigeria         1483268.23
Egypt            866379.92
South Africa     517590.54
Ethiopia         448683.76
Morocco          388495.36
Name: Y2017, dtype: float64

In [30]:
df.iloc[1,1]

'Algeria'

In [31]:
df.shape

(60943, 12)

In [32]:
Y17 = df["Y2017"]

In [33]:
print(f"{Y17.mean():.2f}"),print(f"{Y17.std():.2f}")

140.92
1671.86

(None, None)

In [34]:
df.groupby(["Area"])["Y2017"].sum().sort_values().head(7)

Area
Sudan (former)               0.00
Ethiopia PDR                 0.00
Comoros                     59.84
Seychelles                 442.34
Sao Tome and Principe    12662.63
Cabo Verde               14650.74
Guinea-Bissau            19102.77
Name: Y2017, dtype: float64

In [35]:
len(df)

60943

In [36]:
import math
#math is an inbuilt python module

In [37]:
cou= df["Area"].unique()
cou

array(['Algeria', 'Angola', 'Benin', 'Botswana', 'Burkina Faso',
       'Cabo Verde', 'Cameroon', 'Central African Republic', 'Chad',
       'Comoros', 'Congo', "CÃ´te d'Ivoire", 'Djibouti', 'Egypt',
       'Eswatini', 'Ethiopia', 'Ethiopia PDR', 'Gabon', 'Gambia', 'Ghana',
       'Guinea', 'Guinea-Bissau', 'Kenya', 'Lesotho', 'Liberia',
       'Madagascar', 'Malawi', 'Mali', 'Mauritania', 'Mauritius',
       'Morocco', 'Mozambique', 'Namibia', 'Niger', 'Nigeria', 'Rwanda',
       'Sao Tome and Principe', 'Senegal', 'Seychelles', 'Sierra Leone',
       'South Africa', 'Sudan', 'Sudan (former)', 'Togo', 'Tunisia',
       'Uganda', 'United Republic of Tanzania', 'Zambia', 'Zimbabwe'],
      dtype=object)

In [38]:
gr = df.groupby(["Area","Element"])["Y2015"].sum()
gr["Madagascar"]

Element
Domestic supply quantity                  31214.98
Export Quantity                             494.75
Fat supply quantity (g/capita/day)           91.85
Feed                                       2070.22
Food                                      21120.65
Food supply (kcal/capita/day)              7685.00
Food supply quantity (kg/capita/yr)         871.59
Import Quantity                            1721.80
Losses                                     2176.00
Other uses (non-food)                      3957.12
Processing                                 1803.00
Production                                29482.89
Protein supply quantity (g/capita/day)      173.05
Residuals                                  -616.00
Seed                                        699.00
Stock Variation                            -505.00
Total Population - Both sexes             24234.00
Name: Y2015, dtype: float64

* Madagascar hada a protein supply of 175.05 in Y2015

In [39]:
df.corr()["Element Code"].sort_values()

Item Code      -0.024683
ï»¿Area Code   -0.000209
Y2016           0.023444
Y2015           0.023889
Y2017           0.024254
Y2018           0.024279
Y2014           0.024457
Element Code    1.000000
Name: Element Code, dtype: float64

In [40]:
import numpy as np
data = np.random.randint(1,100,size = (100,3))
data.shape

(100, 3)

* The dataframe has 100 observations(rows) and with 3 columns(rows)

In [41]:
df.groupby(["Element"])["Y2017"].sum()

Element
Domestic supply quantity                  2088198.10
Export Quantity                            182338.80
Fat supply quantity (g/capita/day)          10253.84
Feed                                       223705.68
Food                                      1258888.28
Food supply (kcal/capita/day)              454681.00
Food supply quantity (kg/capita/yr)         48690.04
Import Quantity                            294559.09
Losses                                     160614.00
Other uses (non-food)                       91645.97
Processing                                 292836.00
Production                                2030056.89
Protein supply quantity (g/capita/day)      11842.45
Residuals                                   35500.00
Seed                                        24870.14
Stock Variation                             54316.91
Total Population - Both sexes             1112641.00
Tourist consumption                            91.00
Name: Y2017, dtype: float64

* The sum of processing in Y2017 is 292836

In [42]:
y = {3,9,8,6,4,9,3,2,0,1}
y

{0, 1, 2, 3, 4, 6, 8, 9}

In [43]:
type(y)

set

In [44]:
df.columns

Index(['ï»¿Area Code', 'Area', 'Item Code', 'Item', 'Element Code', 'Element',
       'Unit', 'Y2014', 'Y2015', 'Y2016', 'Y2017', 'Y2018'],
      dtype='object')

In [45]:
df.head(2)

,ï»¿Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.0,39728.0,40551.0,41389.0,42228.0
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.0,0.0,0.0,0.0,0.0

In [46]:
"ï»¿Area Code"

'ï»¿Area Code'

In [47]:
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = ["Age","Nationality","Overall"]

pd.DataFrame(lst, columns = col, index = [1,2,3])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [48]:
pd.DataFrame(lst, columns = col, index = [i for i in range(1,4)])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [49]:
my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment